INSERT INTO menus (name, price)
VALUES
    ('はな', 8650),
    ('わだつみ', 5680),
    ('あさなぎ', 4440),
    ('ゆうなぎ', 3830),
    ('くろしお', 2830),
    ('いさりび', 2180),
    ('みさき', 1940),
    ('みなと', 1490),
    ('しおん', 1060),
    ('なぎさ', 800),
    ('海鮮ちらし', 1280),
    ('鉄火丼', 1280),
    ('鮨八宝巻', 1280),
    ('玉子', 100),
    ('いなり', 100),
    ('納豆軍艦', 100),
    ('ツナサラダ', 100),
    ('コーン', 100),
    ('かにサラダ', 100),
    ('オクラ軍艦', 100),
    ('ゆでげそ', 150),
    ('とびっこ', 150),
    ('明太子サラダ', 150),
    ('いかの塩辛', 150),
    ('かんぴょう巻', 150),
    ('なっとう巻', 150),
    ('かっぱ巻', 150),
    ('おしんこ巻', 150),
    ('梅しそ巻', 150),
    ('えび', 180),
    ('赤いか', 180),
    ('かにみそ軍艦', 180),
    ('生サーモン', 220),
    ('オニオンサーモン', 220),
    ('まぐろ赤身', 220),
    ('ゆでたこ', 220),
    ('あじ', 260),
    ('赤えび', 260),
    ('生たこ', 260),
    ('えんがわ', 260),
    ('炙りえんがわ', 260),
    ('まぐろ塩だれ焼', 260),
    ('焼えび', 260),
    ('ねぎとろ', 260),
    ('炙りサーモン', 260),
    ('鉄火巻', 260),
    ('まぐろワサビ巻', 260),
    ('いくら', 360),
    ('ホタテ貝', 360),
    ('穴子', 360),
    ('真鯛', 360),
    ('活ヒラメ', 400),
    ('数の子', 400),
    ('ずわいがに', 400),
    ('トロタク巻', 400),
    ('すじこ巻', 400),
    ('中トロ', 460),
    ('特大海老', 460),
    ('あなご一本すし', 520),
    ('まぐろづくし', 520),
    ('白身づくし', 520),
    ('うに', 600),
    ('インドまぐろ大トロ', 600);

INSERT INTO customers (name, tel)
VALUES
    ('たなか たろう', '090-1234-5678'),
    ('すずき じろう', '090-1234-5679');

INSERT INTO rice_sizes (rice_size)
VALUES
    ('大'),
    ('中'),
    ('小');

INSERT INTO orders (total_quantity, total_payment, tax_amount, paid, customer_id)
VALUES
    (7, 930, 74, true, 1),
    (8, 2080, 166, false, 2);

INSERT INTO order_details (quantity, tax_rate, order_id, menu_id)
VALUES
    (2, 0.08, 1, 14),
    (1, 0.08, 1, 16),
    (2, 0.08, 1, 25),
    (1, 0.08, 1, 27),
    (1, 0.08, 1, 31),
    (2, 0.08, 2, 32),
    (1, 0.08, 2, 35),
    (2, 0.08, 2, 37),
    (1, 0.08, 2, 45),
    (2, 0.08, 2, 51);
